RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S6X/middleware/sdmmc/sd/fsl_sd.c
        blockDone += blockCountOneTime;

        if (!card->noInteralAlign && (!dataAddrAlign))
        {
            (void)memcpy(nextBuffer, alignBuffer, FSL_SDMMC_DEFAULT_BLOCK_SIZE);
        }
    }

    (void)SDMMC_OSAMutexUnlock(&card->lock);

    return error;
}

status_t SD_WriteBlocks(sd_card_t *card, const uint8_t *buffer, uint32_t startBlock, uint32_t blockCount)
{
    assert(card != NULL);
    assert(buffer != NULL);
    assert(blockCount != 0U);
    assert((blockCount + startBlock) <= card->blockCount);

    uint32_t blockCountOneTime   = 0U; /* The block count can be wrote in one time sending WRITE_BLOCKS command. */
    uint32_t blockWrittenOneTime = 0U;
    uint32_t blockLeft           = 0U; /* Left block count to be wrote. */
    const uint8_t *nextBuffer;
    bool dataAddrAlign   = true;
    uint8_t *alignBuffer = (uint8_t *)FSL_SDMMC_CARD_INTERNAL_BUFFER_ALIGN_ADDR(card->internalBuffer);
    status_t error       = kStatus_Success;

    (void)SDMMC_OSAMutexLock(&card->lock, osaWaitForever_c);

    blockLeft = blockCount;
    while (blockLeft != 0U)
    {
        nextBuffer = (uint8_t *)((uint32_t)buffer + (blockCount - blockLeft) * FSL_SDMMC_DEFAULT_BLOCK_SIZE);
        if (!card->noInteralAlign && (!dataAddrAlign || ((((uint32_t)nextBuffer) & (sizeof(uint32_t) - 1U)) != 0U)))
        {
            blockCountOneTime = 1;
            (void)memcpy(alignBuffer, nextBuffer, FSL_SDMMC_DEFAULT_BLOCK_SIZE);
            dataAddrAlign = false;
        }
        else
        {
            if (blockLeft > card->host->maxBlockCount)
            {
                blockCountOneTime = card->host->maxBlockCount;
            }
            else
            {
                blockCountOneTime = blockLeft;
            }
        }

        error = SD_Write(card, dataAddrAlign ? nextBuffer : alignBuffer, (startBlock + blockCount - blockLeft),
                         FSL_SDMMC_DEFAULT_BLOCK_SIZE, blockCountOneTime, &blockWrittenOneTime);
        if (kStatus_Success != error)
        {
            error = kStatus_SDMMC_TransferFailed;
            break;
        }

        blockLeft -= blockWrittenOneTime;

        if ((!card->noInteralAlign) && !dataAddrAlign)
        {
            (void)memset(alignBuffer, 0, FSL_SDMMC_DEFAULT_BLOCK_SIZE);
        }
    }

    (void)SDMMC_OSAMutexUnlock(&card->lock);

    return error;
}

static uint32_t SD_CalculateEraseTimeout(sd_card_t *card, uint32_t blockCount, uint32_t auSize)
{
    uint32_t auCount    = blockCount / (auSize / FSL_SDMMC_DEFAULT_BLOCK_SIZE);
    uint32_t timeout_ms = 0U;

    if (auCount == 0U)
    {
        auCount = 1U;
    }

    timeout_ms = auCount * 250U; /* 250 ms erase timeout per AU by default */

    if ((card->stat.eraseTimeout != 0U) && (card->stat.eraseSize != 0U))
    {
        /* timeout determined by the block count to be erased and the au size */
        timeout_ms = auCount * (((uint32_t)card->stat.eraseTimeout * 1000U) / (uint32_t)card->stat.eraseSize + 500U) +
                     card->stat.eraseOffset * 1000U;
    }

    /* convert to ms */
    return timeout_ms < 1000U ? 1000U : timeout_ms;
}

status_t SD_EraseBlocks(sd_card_t *card, uint32_t startBlock, uint32_t blockCount)
{
    assert(card != NULL);
    assert(blockCount != 0U);
    assert((blockCount + startBlock) <= card->blockCount);

    uint32_t blockCountOneTime; /* The block count can be erased in one time sending ERASE_BLOCKS command. */
    uint32_t blockDone = 0U;    /* The block count has been erased. */
    uint32_t blockLeft;         /* Left block count to be erase. */
    status_t error                 = kStatus_Success;
    uint32_t onetimeMaxEraseBlocks = 0U;
    uint32_t auSize                = 0U;

    (void)SDMMC_OSAMutexLock(&card->lock, osaWaitForever_c);

    /* sdsc card erasable sector is determined by CSD register */
    if (card->csd.csdStructure == 0U)
    {
        onetimeMaxEraseBlocks = card->csd.eraseSectorSize + 1UL;
    }
    else
    {
        /* limit one time maximum erase size to 1 AU */
        if ((card->stat.auSize >= SD_AU_START_VALUE))
        {
            /* UHS card should use uhs au size field */
            if (card->operationVoltage == kSDMMC_OperationVoltage180V)
            {
                auSize = s_sdAuSizeMap[card->stat.uhsAuSize == 0U ? card->stat.auSize : card->stat.uhsAuSize];
                onetimeMaxEraseBlocks = auSize / FSL_SDMMC_DEFAULT_BLOCK_SIZE;
            }
            else
            {
                auSize                = s_sdAuSizeMap[card->stat.auSize];
                onetimeMaxEraseBlocks = auSize / FSL_SDMMC_DEFAULT_BLOCK_SIZE;
            }

            if (card->stat.eraseSize != 0U)
            {
                onetimeMaxEraseBlocks *= card->stat.eraseSize;
            }
        }
    }

    if (onetimeMaxEraseBlocks == 0U)
    {
        SDMMC_LOG(
            "Warning: AU size in sd descriptor is not set properly, please check if SD_ReadStatus is called before\
          SD_EraseBlocks\r\n");
        error = kStatus_SDMMC_AuSizeNotSetProperly;
    }
    else
    {
        blockLeft = blockCount;
        while (blockLeft != 0U)
        {
            if (blockLeft > onetimeMaxEraseBlocks)
            {
                blockCountOneTime = onetimeMaxEraseBlocks;
                blockLeft         = blockLeft - blockCountOneTime;
            }
            else
            {
                blockCountOneTime = blockLeft;
                blockLeft         = 0U;
            }

            error = SD_Erase(card, (startBlock + blockDone), blockCountOneTime,
                             SD_CalculateEraseTimeout(card, blockCountOneTime, auSize));
            if (error != kStatus_Success)
            {
                break;
            }

            blockDone += blockCountOneTime;
        }
    }

    (void)SDMMC_OSAMutexUnlock(&card->lock);

    return error;
}

static status_t SD_ProbeBusVoltage(sd_card_t *card)
{
    assert(card != NULL);

    uint32_t applicationCommand41Argument = 0U;
    status_t error                        = kStatus_Success;

    /* 3.3V voltage should be supported as default */
    applicationCommand41Argument |=
        SDMMC_MASK(kSD_OcrVdd29_30Flag) | SDMMC_MASK(kSD_OcrVdd32_33Flag) | SDMMC_MASK(kSD_OcrVdd33_34Flag);

    if ((card->usrParam.ioVoltage != NULL) && (card->usrParam.ioVoltage->type != kSD_IOVoltageCtrlNotSupport) &&
        ((card->host->capability & (uint32_t)kSDMMCHOST_SupportVoltage1v8) != 0U) &&
        ((card->host->capability & ((uint32_t)kSDMMCHOST_SupportSDR104 | (uint32_t)kSDMMCHOST_SupportSDR50 |
                                    (uint32_t)kSDMMCHOST_SupportDDRMode)) != 0U))
    {
        /* allow user select the work voltage, if not select, sdmmc will handle it automatically */
        applicationCommand41Argument |= SDMMC_MASK(kSD_OcrSwitch18RequestFlag);
        /* reset to 3v3 signal voltage */
        if (SD_SwitchIOVoltage(card, kSDMMC_OperationVoltage330V) == kStatus_Success)
        {
            /* Host changed the operation signal voltage successfully, then card need power reset */
            SD_SetCardPower(card, false);
            SD_SetCardPower(card, true);
        }
    }

    card->operationVoltage = kSDMMC_OperationVoltage330V;

    /* send card active */
    SDMMCHOST_SendCardActive(card->host);

    do
    {
        /* card go idle */
        if (kStatus_Success != SD_GoIdle(card))
        {
            error = kStatus_SDMMC_GoIdleFailed;
            break;
        }

        error = SD_SendInterfaceCondition(card);
        /* Check card's supported interface condition. */
        if (kStatus_Success == error)
        {
            /* SDHC or SDXC card */
            applicationCommand41Argument |= SDMMC_MASK(kSD_OcrHostCapacitySupportFlag);
            card->flags |= (uint32_t)kSD_SupportSdhcFlag;
        }
        else
        {
            /* SDSC card */
            if (kStatus_Success != SD_GoIdle(card))
            {
                error = kStatus_SDMMC_GoIdleFailed;
                break;
            }
        }
        error = SD_ApplicationSendOperationCondition(card, applicationCommand41Argument);
        /* Set card interface condition according to SDHC capability and card's supported interface condition. */
        if (kStatus_Success != error)
        {
            error = kStatus_SDMMC_HandShakeOperationConditionFailed;
            break;
        }

